In [68]:
# imports

import pandas as pd
import numpy as np
import os

import matplotlib.pyplot as plt
import seaborn as sns

from pydataset import data

In [31]:
# creating and loading the iris database

df_iris = sns.load_dataset('iris')

In [32]:
# print the first 3 rows

df_iris.head(3)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa

In [33]:
# print the number of rows and columns (shape)

df_iris.shape

(150, 5)

In [34]:
# print the column names

df_iris.columns

Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width',
       'species'],
      dtype='object')

In [71]:
# print the data type of each column

df_iris.dtypes

sepal_length    float64
sepal_width     float64
petal_length    float64
petal_width     float64
species          object
dtype: object

In [72]:
# print the summary statistics for each of the numeric variables

df_iris.describe().T #.T Transpose the data

              count      mean       std  min  25%   50%  75%  max
sepal_length  150.0  5.843333  0.828066  4.3  5.1  5.80  6.4  7.9
sepal_width   150.0  3.057333  0.435866  2.0  2.8  3.00  3.3  4.4
petal_length  150.0  3.758000  1.765298  1.0  1.6  4.35  5.1  6.9
petal_width   150.0  1.199333  0.762238  0.1  0.3  1.30  1.8  2.5

In [37]:
# print the unique values for each of your categorical variables

df_iris.nunique()

sepal_length    35
sepal_width     23
petal_length    43
petal_width     22
species          3
dtype: int64

In [80]:
# Read the Table1_CustDetails table from the Excel_Exercises.xlsx file into a dataframe named df_excel

df_excel = pd.read_excel("Cust_Churn_Telco.xlsx")

In [81]:
df_excel.head(3).T

                                 0             1               2
customerID              7590-VHVEG    5575-GNVDE      3668-QPYBK
gender                      Female          Male            Male
SeniorCitizen                    0             0               0
Partner                        Yes            No              No
Dependents                      No            No              No
tenure                           1            34               2
PhoneService                    No           Yes             Yes
MultipleLines     No phone service            No              No
InternetService                DSL           DSL             DSL
OnlineSecurity                  No           Yes             Yes
OnlineBackup                   Yes            No             Yes
DeviceProtection                No           Yes              No
TechSupport                     No            No              No
StreamingTV                     No            No              No
StreamingMovies                 No            No              No
Contract            Month-to-month      One year  Month-to-month
PaperlessBilling               Yes            No             Yes
PaymentMethod     Electronic check  Mailed check    Mailed check
MonthlyCharges               29.85         56.95           53.85
TotalCharges                 29.85        1889.5          108.15
Churn                           No            No             Yes

In [82]:
# assign the first 100 rows to a new dataframe, df_excel_sample
# df_excel_sample= [df_excel.head(100)].copy()
# df_excel_sample

In [83]:
# Assign the first 100 rows
# Solution
df_excel_sample = df_excel.loc[0:100, :].copy() # Why am I using .copy, here?
df_excel_sample.head()

,customerID,gender,SeniorCitizen,Partner,Dependents,tenure,PhoneService,MultipleLines,InternetService,OnlineSecurity,...,DeviceProtection,TechSupport,StreamingTV,StreamingMovies,Contract,PaperlessBilling,PaymentMethod,MonthlyCharges,TotalCharges,Churn
0,7590-VHVEG,Female,0,Yes,No,1,No,No phone service,DSL,No,...,No,No,No,No,Month-to-month,Yes,Electronic check,29.85,29.85,No
1,5575-GNVDE,Male,0,No,No,34,Yes,No,DSL,Yes,...,Yes,No,No,No,One year,No,Mailed check,56.95,1889.50,No
2,3668-QPYBK,Male,0,No,No,2,Yes,No,DSL,Yes,...,No,No,No,No,Month-to-month,Yes,Mailed check,53.85,108.15,Yes
3,7795-CFOCW,Male,0,No,No,45,No,No phone service,DSL,Yes,...,Yes,Yes,No,No,One year,No,Bank transfer (automatic),42.30,1840.75,No
4,9237-HQITU,Female,0,No,No,2,Yes,No,Fiber optic,No,...,No,No,No,No,Month-to-month,Yes,Electronic check,70.70,151.65,Yes

In [84]:
# print the number of rows of your original dataframe
len(df_excel.index)

7043

In [85]:
# print the first 5 column names
df_excel.columns[:5]

Index(['customerID', 'gender', 'SeniorCitizen', 'Partner', 'Dependents'], dtype='object')

In [42]:
# print the column names that have a data type of object
df_excel.select_dtypes(include=['object']).columns

Index(['customerID', 'gender', 'Partner', 'Dependents', 'PhoneService',
       'MultipleLines', 'InternetService', 'OnlineSecurity', 'OnlineBackup',
       'DeviceProtection', 'TechSupport', 'StreamingTV', 'StreamingMovies',
       'Contract', 'PaperlessBilling', 'PaymentMethod', 'Churn'],
      dtype='object')

In [43]:
df_excel.head()

,customerID,gender,SeniorCitizen,Partner,Dependents,tenure,PhoneService,MultipleLines,InternetService,OnlineSecurity,...,DeviceProtection,TechSupport,StreamingTV,StreamingMovies,Contract,PaperlessBilling,PaymentMethod,MonthlyCharges,TotalCharges,Churn
0,7590-VHVEG,Female,0,Yes,No,1,No,No phone service,DSL,No,...,No,No,No,No,Month-to-month,Yes,Electronic check,29.85,29.85,No
1,5575-GNVDE,Male,0,No,No,34,Yes,No,DSL,Yes,...,Yes,No,No,No,One year,No,Mailed check,56.95,1889.50,No
2,3668-QPYBK,Male,0,No,No,2,Yes,No,DSL,Yes,...,No,No,No,No,Month-to-month,Yes,Mailed check,53.85,108.15,Yes
3,7795-CFOCW,Male,0,No,No,45,No,No phone service,DSL,Yes,...,Yes,Yes,No,No,One year,No,Bank transfer (automatic),42.30,1840.75,No
4,9237-HQITU,Female,0,No,No,2,Yes,No,Fiber optic,No,...,No,No,No,No,Month-to-month,Yes,Electronic check,70.70,151.65,Yes

In [44]:
df_excel.max()

customerID            9995-HOTOH
gender                      Male
SeniorCitizen                  1
Partner                      Yes
Dependents                   Yes
tenure                        72
PhoneService                 Yes
MultipleLines                Yes
InternetService               No
OnlineSecurity               Yes
OnlineBackup                 Yes
DeviceProtection             Yes
TechSupport                  Yes
StreamingTV                  Yes
StreamingMovies              Yes
Contract                Two year
PaperlessBilling             Yes
PaymentMethod       Mailed check
MonthlyCharges            118.75
TotalCharges              8684.8
Churn                        Yes
dtype: object

In [45]:
df_excel.min()

customerID                         0002-ORFBO
gender                                 Female
SeniorCitizen                               0
Partner                                    No
Dependents                                 No
tenure                                      0
PhoneService                               No
MultipleLines                              No
InternetService                           DSL
OnlineSecurity                             No
OnlineBackup                               No
DeviceProtection                           No
TechSupport                                No
StreamingTV                                No
StreamingMovies                            No
Contract                       Month-to-month
PaperlessBilling                           No
PaymentMethod       Bank transfer (automatic)
MonthlyCharges                          18.25
TotalCharges                             18.8
Churn                                      No
dtype: object

In [46]:
tenure_range = df_excel.tenure.max() - df_excel.tenure.min()
month_range = df_excel.MonthlyCharges.max() - df_excel.MonthlyCharges.min()
total_range = df_excel.TotalCharges.max() - df_excel.TotalCharges.min()

In [89]:
# compute the range for each of the numeric variables.
numerics = df_excel.select_dtypes(include=['float64', 'int64'])

In [91]:
# solution
print("Range from min-max of numeric values")
numerics.max() - numerics.min()

Range from min-max of numeric values

SeniorCitizen        1.0
tenure              72.0
MonthlyCharges     100.5
TotalCharges      8666.0
dtype: float64

In [47]:
# compute the range for each of the numeric variables.
print(tenure_range, month_range, total_range)

72 100.5 8666.0

In [48]:
# Read the data from this google sheet into a dataframe, df_google

sheet_url = 'https://docs.google.com/spreadsheets/d/1Uhtml8KY19LILuZsrDtlsHHDC9wuDGUSe8LTEwvdI5g/edit#gid=341089357'    

csv_export_url = sheet_url.replace('/edit#gid=', '/export?format=csv&gid=')

df_google = pd.read_csv(csv_export_url)
df_google.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [49]:
# print the first 3 rows
df_google.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [50]:
# print the number of rows and columns
df_google.shape

(891, 12)

In [51]:
# print the column names
df_google.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [52]:
# print the data type of each column
df_google.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [87]:
# print the summary statistics for each of the numeric variables

df_google.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [54]:
df_google.nunique()

PassengerId    891
Survived         2
Pclass           3
Name           891
Sex              2
Age             88
SibSp            7
Parch            7
Ticket         681
Fare           248
Cabin          147
Embarked         3
dtype: int64

In [93]:
# print the unique values for each of your categorical variables
# solution
for column in df_google.select_dtypes(include='object').columns:
    print(f"Values in the {column} column:")
    print(df_google[column].value_counts())
    print("------")
    print()

Values in the Name column:
Yousif, Mr. Wazli                                           1
Sandstrom, Miss. Marguerite Rut                             1
Saalfeld, Mr. Adolphe                                       1
Gilnagh, Miss. Katherine "Katie"                            1
Watt, Mrs. James (Elizabeth "Bessie" Inglis Milne)          1
                                                           ..
Nicola-Yarred, Master. Elias                                1
Taussig, Mrs. Emil (Tillie Mandelbaum)                      1
Fry, Mr. Richard                                            1
Turpin, Mrs. William John Robert (Dorothy Ann Wonnacott)    1
Skoog, Miss. Mabel                                          1
Name: Name, Length: 891, dtype: int64
------

Values in the Sex column:
male      577
female    314
Name: Sex, dtype: int64
------

Values in the Ticket column:
1601            7
CA. 2343        7
347082          7
347088          6
CA 2144         6
               ..
PC 17482        1
374746          1
36568           1
250651          1
F.C.C. 13531    1
Name: Ticket, Length: 681, dtype: int64
------

Values in the Cabin column:
C23 C25 C27        4
G6                 4
B96 B98            4
D                  3
E101               3
F2                 3
F33                3
C22 C26            3
C2                 2
E33                2
E8                 2
B51 B53 B55        2
C65                2
C92                2
D35                2
B18                2
F G73              2
B22                2
B57 B59 B63 B66    2
D33                2
B20                2
E121               2
B35                2
F4                 2
C68                2
B58 B60            2
E25                2
D26                2
E24                2
B5                 2
C93                2
C83                2
C78                2
E67                2
C125               2
C52                2
B49                2
D17                2
B77                2
D36                2
D20                2
B28                2
C123               2
C124               2
E44                2
C126               2
B39                1
D7                 1
B94                1
B50                1
E58                1
D6                 1
E34                1
D46                1
A5                 1
E31                1
C82                1
E17                1
C62 C64            1
A10                1
T                  1
B3                 1
C106               1
C91                1
C85                1
D37                1
B73                1
B42                1
B41                1
E49                1
C101               1
B4                 1
B101               1
D11                1
C32                1
E63                1
D21                1
B71                1
C30                1
D30                1
D19                1
B78                1
C7                 1
E50                1
A20                1
A31                1
D56                1
C70                1
D28                1
C86                1
A26                1
C110               1
A23                1
E68                1
A14                1
D49                1
F E69              1
F G63              1
C49                1
E10                1
D50                1
A7                 1
A19                1
A34                1
C148               1
D9                 1
E46                1
C118               1
D45                1
B38                1
C90                1
C103               1
B102               1
C47                1
B69                1
D47                1
F38                1
D48                1
B79                1
C50                1
D10 D12            1
A36                1
A24                1
C45                1
B86                1
C104               1
E40                1
E36                1
D15                1
E12                1
C87                1
A6                 1
C99                1
B37                1
B80                1
A32                1
E77                1
B19                1
C54                1
C111               1
C95                1
B30                1
B82 B84            1
C46                1
A16                1
E38                1
C128               1
Name: Cabin, dtype: int64
------

Values in the Embarked column:
S    644
C    168
Q     77
Name: Embarked, dtype: int64
------

In [61]:
#aquire.py exercises
# getting data from titanic_db in codeup db
from env import host, user, password

url = f'mysql+pymysql://{user}:{password}@{host}/titanic_db'
    
def get_db_url(user,password,host,database):
    
    return f'mysql+pymysql://{user}:{password}@{host}/{database}'

In [62]:
# getting data from titanic_db in codeup db
import pandas as pd
from env import user, password, host

pd.read_sql("select * from passengers", get_db_url(user, password, host, 'titanic_db'))

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,None,Southampton,0
1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0
2,2,1,3,female,26.0,0,0,7.9250,S,Third,None,Southampton,1
3,3,1,1,female,35.0,1,0,53.1000,S,First,C,Southampton,0
4,4,0,3,male,35.0,0,0,8.0500,S,Third,None,Southampton,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,886,0,2,male,27.0,0,0,13.0000,S,Second,None,Southampton,1
887,887,1,1,female,19.0,0,0,30.0000,S,First,B,Southampton,1
888,888,0,3,female,NaN,1,2,23.4500,S,Third,None,Southampton,0
889,889,1,1,male,26.0,0,0,30.0000,C,First,C,Cherbourg,1
890,890,0,3,male,32.0,0,0,7.7500,Q,Third,None,Queenstown,1

In [63]:
# getting data from iris_db from codeup db

from env import host, user, password

url = f'mysql+pymysql://{user}:{password}@{host}/iris_db'
    
def get_db_url(user,password,host,database):
    
    return f'mysql+pymysql://{user}:{password}@{host}/{database}'

In [66]:
# getting data from iris_db from codeup db

import pandas as pd
from env import user, password, host

pd.read_sql("select * from species join measurements using(species_id)", get_db_url(user, password, host, 'iris_db'))

,species_id,species_name,measurement_id,sepal_length,sepal_width,petal_length,petal_width
0,1,setosa,1,5.1,3.5,1.4,0.2
1,1,setosa,2,4.9,3.0,1.4,0.2
2,1,setosa,3,4.7,3.2,1.3,0.2
3,1,setosa,4,4.6,3.1,1.5,0.2
4,1,setosa,5,5.0,3.6,1.4,0.2
...,...,...,...,...,...,...,...
145,3,virginica,146,6.7,3.0,5.2,2.3
146,3,virginica,147,6.3,2.5,5.0,1.9
147,3,virginica,148,6.5,3.0,5.2,2.0
148,3,virginica,149,6.2,3.4,5.4,2.3
149,3,virginica,150,5.9,3.0,5.1,1.8

In [67]:
# df.to_csv("get_titanic_data.csv")

NameError: name 'df' is not defined